{
    "igcse": [
        {
            "id": "igcse-english1",
            "subject": "English",
            "heading": "English Literature (500)",
            "image": "images/igcse-english1.jpg",
            "description": "<p>First language English <strong>(500)</strong> emphasizes on the need to read a wide variety of texts and type of texts. Students are assessed on very clearly defined assessment objectives that are both identifiable and measurable. Students are expected to:</p><ul><li>Demonstrate their understanding of differences between explicit and implicit information.</li><li>Understand and communicate complex information, and select what is relevant for specific purposes.</li><li>Understand and evaluate subtle facts, ideas and opinions.</li><li>Present material in a clearly structured, sequenced, developed and detailed way.</li><li>Describe and analyse experience, expressing effectively what is felt and what is imagined.</li><li>Recognize implicit meanings and attitudes of a writer, and the means by which they have been conveyed.</li><li>Show a strong sense of audience and an understanding of appropriate uses of language for different purposes.</li><li>Write in well-constructed paragraphs, using a full range of appropriate sentence types, and a wide mature vocabulary.</li><li>Demonstrate a high degree of accuracy in use of grammatical structures, spelling and punctuation.</li></ul><p>We at aimIB7 offer customized skill based sessions with organic interaction with a highly-experienced teacher. <strong>We guarantee excellent results in this area.</strong></p>"
        },
        {
            "id": "igcse-english2",
            "subject": "English",
            "heading": "English Literature (486)",
            "image": "images/igcse-english2.jpg",
            "description": "<p>Students of English Literature (486) are taught to evaluate literary pieces in detail. The schools under CIE guidelines, select Poems, Short Stories and Drama. In addition, the students are also expected to be able to evaluate unseen selections from other literary texts. The course is aimed at training students to:</p> <ul> <li>Sustain a perceptive and convincing response with well-chosen detail of narrative and situation.</li> <li>Demonstrate clear critical/analytical understanding of the author’s intentions and the text’s deeper implications and the attitudes it displays.</li> <li>Make much well-selected reference to the text respond sensitively and in detail to the way language works in the text.</li> <li>Communicate a considered and reflective personal response to the text.</li> </ul> <p>IGCSE aims at enabling students not just to be able to read, but also to be able to respond different genres and comment on their textual, stylistic and literary conventions. The students are expected to take a stance on the text and evaluate the author’s craft. This can be a difficult task if the student does not have proper support system in place. aimIB7 fills this gap and promises an academically rich delivery aimed not only at the skill development, but also at content delivery and teaching support for regular syllabus.</p> <p><strong>aimIB7</strong> offers personal coaching sessions:</p> <ul> <li>Language Use - including figurative language</li> <li>Linguistic Analysis</li> <li>Discourse Genres across all media</li> <li>Literary Genres</li> <li>Mode, Register, Domain</li> <li>Different Structures and Organizational Styles</li> <li>Stylistic Techniques</li> <li>Analytical Thinking</li> <li>Writing Strategies</li> <li>Comparative Writing</li> <li>Academic Writing</li> <li>Creative Writing</li> </ul> <p>Students will be exposed to rigorous practice sessions and teaching classes followed by assignments and assessments closely based on past IGCSE papers, and will be given detailed feedback on how to improve in each of the criteria stipulated for the IGCSE.</p> <p>aimIB7 guides the students on how to score the highest grades by improving their analytical and critical writing abilities. We do provide a fall-back support system for students facing difficulty in understanding the key texts too. We do provide all ethical assignment support.</p>"

        },
        {
            "id": "igcse-math1",
            "subject": "Mathematics",
            "heading": "Additional Math (IGCSE)",
            "image": "images/igcse-math1.jpg",
            "description": "<p>Cambridge IGCSE Additional Mathematics is accepted by universities and employers as proof of essential mathematical knowledge and ability.</p><p>The Additional Mathematics syllabus is intended for high ability candidates who have achieved, or are likely to achieve, Grade A*, A or B in the Cambridge IGCSE Mathematics examination.</p><p>Successful Cambridge IGCSE Additional Mathematics candidates gain lifelong skills, including:</p><ul><li>the further development of mathematical concepts and principles</li><li>the extension of mathematical skills and their use in more advanced techniques</li><li>an ability to solve problems, present solutions logically and interpret results</li><li>a solid foundation for further study.</li></ul><p><strong>Prior learning</strong></p><p>We recommend that candidates who are beginning this course should be currently studying or have previously studied Cambridge IGCSE or Cambridge O Level Mathematics progression Cambridge.</p><p><strong>Course contents</strong></p><ol><li>Sets and Relations</li><li>Functions</li><li>Quadratic functions</li><li>Indices and surds</li><li>Factors and polynomials</li><li>Simultaneous equations</li><li>Logarithmic and exponential functions</li><li>Straight line graphs</li><li>Circular measure</li><li>Trigonometry</li><li>Permutations &amp; Combinations</li><li>Binomial expansions</li><li>Vectors in two dimensions</li><li>Matrices</li><li>Differentiation and Integration</li></ol><p>We at aimIB7 offer customized skill based sessions with organic interaction with a highly-experienced teacher. <strong>We guarantee excellent results in this area.</strong> For a more detailed IB Mathematics Curriculum Model for HL and SL students. <a href='#'>Click Here</a>.</p>"
        },
        {
            "id": "igcse-math2",
            "subject": "Mathematics",
            "heading": "Mathematics (Extended)",
            "image": "images/igcse-math2.jpg",
            "description": "<p>Cambridge IGCSE Mathematics is accepted by universities and employers as proof of mathematical knowledge and understanding. Successful Cambridge IGCSE Mathematics candidates gain lifelong benefits including:</p><ul><li>the development of their mathematical knowledge</li><li>confidence, by developing a feel for numbers, patterns and relationships</li><li>an ability to consider and solve problems and present and interpret results</li><li>skills in communication and reasoning using mathematical concepts</li><li>a solid conceptual foundation for further study.</li></ul><p><strong>Course contents</strong></p><p>Candidates may follow either the Core curriculum or the Extended curriculum. Candidates aiming for grades</p><p>A* to C should follow the Extended curriculum.</p><p>All candidates will study the following topics:</p><ol><li>Number</li><li>Algebra and graphs</li><li>Geometry</li><li>Mensuration</li><li>Co-ordinate geometry</li><li>Trigonometry</li><li>Matrices and transformations</li><li>Probability</li><li>Statistics</li></ol><p>We at aimIB7 offer customized skill based sessions with organic interaction with a highly-experienced teacher. <strong>We guarantee excellent results in this area.</strong> For a more detailed IB Mathematics Curriculum Model for HL and SL students. <a href='#'>Click Here</a>.</p>"
        },
        {
            "id": "igcse-math3",
            "subject": "Mathematics",
            "heading": "Mathematics (core)",
            "image": "images/igcse-math3.jpg",
            "description": "<p>Cambridge IGCSE mathematics core is intended to impart basic mathematical concepts to the learners.</p><p>Successful Cambridge IGCSE Mathematics candidates gain lifelong benefits, including</p><ul><li>the development of their mathematical knowledge</li><li>confidence, by developing a feel for numbers, patterns and relationships</li><li>an ability to consider and solve problems and present and interpret results</li></ul><p><strong>Course contents</strong></p><p>Candidates may follow either the Core curriculum or the Extended curriculum. Candidates aiming for grades</p><p>A* to C should follow the Extended curriculum.</p><p>All candidates will study the following topics:</p><ol><li>Number</li><li>Algebra and graphs</li><li>Geometry</li><li>Mensuration</li><li>Co-ordinate geometry</li><li>Trigonometry</li><li>Matrices and transformations</li><li>Probability</li><li>Statistics</li></ol><p>We at aimIB7 offer customized skill based sessions with organic interaction with a highly-experienced teacher. <strong>We guarantee excellent results in this area.</strong> For a more detailed IB Mathematics Curriculum Model for HL and SL students. <a href='#'>Click Here</a>.</p>"
        },
        {
            "id": "igcse-economics1",
            "subject": "Economics",
            "heading": "Cambridge IGCSE Economics (0455)",
            "image": "images/igcse-economics1.jpg",
            "description": "<p><strong>Key Skill Focus</strong></p><ul><li>an understanding of economic theory, terminology and principles</li><li>the ability to apply the tools of economic analysis</li><li>the ability to distinguish between facts and value judgements in economic issues</li><li>an understanding of, and an ability to use, basic economic numeracy and literacy</li><li>the ability to take a greater part in decision-making processes in everyday life</li><li>an understanding of the economies of developed and developing nations</li><li>an excellent foundation for advanced study in economics.</li></ul><p><strong>Course Coverage</strong></p><ul><li>Basic economic problem: choice and the allocation of resources</li><li>The allocation of resources: how the market works: Market failure</li><li>The individual as producer, consumer and borrower.</li><li>The private firm as producer and employer.</li><li>Role of government in an economy</li><li>Economic Indicators</li><li>Developed and developing economies: trends in production, population and living standards.</li><li>Internal Aspects</li></ul><p><strong>Assessment:</strong></p><p><strong>Paper 1: Multiple Choice (45 minutes)</strong></p><p>Candidates answer 30 multiple choice questions. Weighted at 30% of total available marks.</p><p><strong>Paper 2: Structured Questions: (2 hours 15 minutes)</strong></p><p>Candidates answer one compulsory question, which requires them to interpret and analyse previously unseen data relevant to a real economic situation, and three optional questions from a choice of six. Weighted at 70% of total available marks.</p><p><strong>HOW ARE WE DIFFERENT</strong></p><p>Our rigorous course delivered by Very well qualified and Cambridge experienced faculties ensures skill development and course coverage. We have a regular schedule for teaching, training for skill and assessment followed by feedback. Thorough feedback sessions are specific rubric based feedback from CIE teachers. These teachers aim at the academic rigour only.</p>"
        },
        {
            "id": "igcse-business-studies1",
            "subject": "Business Studies",
            "heading": "Cambridge IGCSE Business Studies (0450)",
            "image": "images/igcse-business-studies1.jpg",
            "description": "<p>The aims of Business Studies as a dynamic subject under IGCSE are to enable candidates to:</p><ul><li>make effective use of relevant terminology, concepts and methods, and recognize the strengths and limitations of the ideas used in business</li><li>apply their knowledge and critical understanding to current issues and problems in a wide range of business contexts</li><li>distinguish between facts and opinions, and evaluate qualitative and quantitative data in order to help build arguments and make informed judgements</li><li>appreciate the perspectives of a range of stakeholders in relation to the business environment, individuals, society, government and enterprise</li><li>develop knowledge and understanding of the major groups and organizations within and outside business, and consider ways in which they are able to influence objectives, decisions and activities</li><li>develop knowledge and understanding of how the main types of businesses are organized, financed and operated, and how their relations with other organizations, consumers, employees, owners and society are regulated</li><li>develop skills of numeracy, literacy, enquiry, selection and use of relevant sources of information, presentation and interpretation</li><li>develop an awareness of the nature and significance of innovation and change within the context of business activities</li></ul><p><strong><u>Course Coverage</u></strong></p><ol><li>Understanding business activity</li><li>People in business</li><li>Marketing</li><li>Operations management</li><li>Financial information and decisions</li><li>External influences on business activity</li></ol><p><strong><u>Assessment</u></strong></p><p><strong>Paper1: Written Paper (1 Hr. 30 Min):</strong> This is a written paper carrying 80 marks with 50% weightage. Four questions requiring a mixture of short answers and structured data responses Candidates answer all questions externally assessed.</p><p><strong>Paper2: Written Paper (1 Hr. 30 Min):</strong> This is a written paper carrying 80 marks with 50% weightage. Four questions based on a case study, provided as an Insert with the paper. Candidates answer all questions. Externally assessed.</p><p>With active intervention and teaching support we provide our students all the extra time they need to hone their skills in terms of the requirements in Business studies paper in the IGCSE. Regular mocks and concept based teaching with printed notes in case of content support we ensure that students get access to all the necessary support and time. Please contact for further details.</p>"
        }
    ],

    "ib": [
        {
            "id": "ib-english1",
            "subject": "English",
            "heading": "English A Literature HL",
            "image": "images/ib-english1.jpg",
            "description": "<p>International Baccalaureate programme in English A Literature HL is an academically rigorous programme that seeks active involvement from the students in terms of its study of Literature, completion of Written Assignments and Individual Oral Commentary and the written papers. These components have different skills and objectives that basically aim at students’ understanding of literary commentary and a comparative essay.</p><p>The acquisition of skills is an ongoing process that requires proper attention and focused enhancement of skills that are a requisite in all internal and external assessments. Students need additional support to cope up with the academic rigour and course expectations to get to the next higher grade. We have on board a few extremely experienced teachers who are IB examiners and hold excellent subject knowledge. They are well equipped with the understanding of the IB assessment patterns along-with the subject expertise.</p><p>The Students who opt for English A Lit. HL course should aim at equipping themselves with an in-depth understanding of English Literature and skills of critically analysing a text. This course is the most rigorous in terms of its academic demand and exposure to world literature. Students whose interest lie elsewhere must opt for English A Language and Literature.</p><p>HL students have to study additional works in each component of the course.</p><p>How can we help you</p><p>We offer personal and online coaching for IB English Lit. HL.</p><ul><li>Rigorous teaching of all works in all parts of the course.</li><li>Material support.</li><li>Training for IOC and IOP</li><li>Written Assignment support</li><li>Training in Analytical writing for paper 1 Literary Commentary</li><li>Training in Comparative Writing</li></ul><p>Regular practice sessions modelled on actual past papers, followed by criteria based teacher feedback which enables the student to improve consciously.</p>"
        },
        {
            "id": "ib-english2",
            "subject": "English",
            "heading": "English A Literature SL",
            "image": "images/ib-english2.jpg",
            "description": "<p>International Baccalaureate programme in English A Literature SL is an academically rigorous programme that seeks active involvement from the students in terms of its study of Literature, completion of Written Assignments and Individual Oral Commentary and the written papers. These components have different skills and objectives that basically aim at students’ understanding of literary commentary and a comparative essay.</p><p>The acquisition of skills is an ongoing process that requires proper attention and focused enhancement of skills that are a requisite in all internal and external assessments. Students need additional support to cope up with the academic rigour and course expectations to get to the next higher grade. We have on board a few extremely experienced teachers who are IB examiners and hold excellent subject knowledge. They are well equipped with the understanding of the IB assessment patterns along-with the subject expertise.</p><p>The Students who opt for English A Lit. SL course should aim at equipping themselves with understanding of English Literature and skills of analysing a text. This course is rigorous compared to other Indian Boards in terms of its academic demand and exposure to world literature. Students who want to have a good understanding of literature and its critical and stylistic aspects must opt for this course.</p><p>In SL the number of texts and academic expectations in paper 1 is slightly lesser compared to HL.</p><p>How can we help you?</p><p>We offer personal and online coaching for IB English Lit. SL.</p><ul><li>Rigorous teaching of all works in all parts of the course.</li><li>Material support.</li><li>Training for IOC and IOP</li><li>Written Assignment support</li><li>Training in Analytical writing for paper 1 GLA</li><li>Training in Comparative Writing</li></ul><p>Regular practice sessions modelled on actual past papers, followed by criteria based teacher feedback which enables the student to improve consciously.</p>"
        },
        {
            "id": "ib-english3",
            "subject": "English",
            "heading": "English A Language and Literature HL",
            "image": "images/ib-english3.jpg",
            "description": "<p>International Baccalaureate programme in English A Lang. and Lit. HL is an academically rigorous programme that seeks active involvement from the students in terms of its study of Literary and non-literary texts. It allows the students to become citizens of the modern world which throws so many different types of information from a variety of media sources. It allows the student to grow and become a person who is not only critical in his review but also one who is equipped with any kind of language demands of the future.</p><p>The acquisition of skills is an ongoing process that requires proper attention and focused enhancement of skills that are a requisite in all internal and external assessments. Students need additional support to cope up with the academic rigour and course expectations to get to the next higher grade. We have on board a few extremely experienced teachers who are IB examiners and hold excellent subject knowledge. They are well equipped with the understanding of the IB assessment patterns along-with the subject expertise.</p><p>The Students who opt for English A Lang. and Lit. HL course should aim at equipping themselves with understanding of English Language and Literature and skills of analysing a text. This course is rigorous compared to other Indian Boards in terms of its academic demand and exposure to world literature. Students who want to have a good understanding of literature and its critical and stylistic aspects must opt for this course.</p><p>In HL the number of texts and academic expectations are overall higher compared to SL.</p><p>How can we help you?</p><p>We offer personal and online coaching for IB English Lit. SL.</p><ul><li>Rigorous teaching of all works in all parts of the course.</li><li>Material support.</li><li>Training for IOC and FOA</li><li>Written Assignment support</li><li>Training in Analytical writing for paper 1 Unseen texts – Literary and Non- Literary</li><li>Training for Writing paper 2</li></ul><p>Regular practice sessions modelled on actual past papers, followed by criteria based teacher feedback which enables the student to improve consciously.</p>"
        },
        {
            "id": "ib-english4",
            "subject": "English",
            "heading": "English A Language and Literature SL",
            "image": "images/ib-english4.jpg",
            "description": "<p>International Baccalaureate programme in English A Lang. and Lit. SL is an academically rigorous programme that seeks active involvement from the students in terms of its study of Literary and non-literary texts. It allows the students to become citizens of the modern world which throws so many different types of information from a variety of media sources. It allows the student to grow and become a person who is not only critical in his review but also one who is equipped with any kind of language demands of the future.</p><p>The acquisition of skills is an ongoing process that requires proper attention and focused enhancement of skills that are a requisite in all internal and external assessments. Students need additional support to cope up with the academic rigour and course expectations to get to the next higher grade. We have on board a few extremely experienced teachers who are IB examiners and hold excellent subject knowledge. They are well equipped with the understanding of the IB assessment patterns along-with the subject expertise.</p><p>The Students who opt for English A Lang. and Lit. SL course should aim at equipping themselves with understanding of English Language and Literature and skills of analysing a text. This course is rigorous compared to other Indian Boards in terms of its academic demand and exposure to world literature. Students who want to have a good understanding of literature and its critical and stylistic aspects must opt for this course.</p><p>In SL the number of texts and academic expectations in paper 1 is slightly lesser compared to HL.</p><p>How can we help you?</p><p>We offer personal and online coaching for IB English Lit. SL.</p><ul><li>Rigorous teaching of all works in all parts of the course.</li><li>Material support.</li><li>Training for IOC and FOA</li><li>Written Assignment support</li><li>Training in Analytical writing for paper 1 Unseen texts – Literary and Non- Literary</li><li>Training for Writing paper 2</li></ul><p>Regular practice sessions modelled on actual past papers, followed by criteria based teacher feedback which enables the student to improve consciously.</p>"
        },
        {
            "id": "ib-math1",
            "subject": "Mathematics",
            "heading": "IB Maths HL Coaching",
            "image": "images/ib-math1.jpg",
            "description": "<p>aimIB7 has on board, the best in the Industry teachers who have delivered excellent results in the past years. We provide individual support classes for HL maths in the Core and Options area of the IB curriculum. We have years of experience in guiding student portfolios and Internal Assessments. We have different provisions for IB Math HL coaching. A student can register for a one on one or in groups of not more than 5 students. For more details, <a href='#'>click here</a>.</p><p><strong>IB Mathematics Overview</strong></p><p>The International Baccalaureate Diploma Programme has, in its offering, two options:</p><ul><li>Mathematics at the standard level [SL]</li><li>Mathematics at the higher level [HL]</li></ul><p>The HL offers an academically rich study of core concepts in Mathematics, keeping the rigour of the course and aims at an in-depth conceptual understanding and application in different contexts. The HL students study core concepts of Mathematics. The HL course goes deeper into the core concepts and offers more academic challenges. The HL course is aimed at a student who enjoys math overall and aims at pursuing math or a subjected related to math for higher studies. Higher Level Mathematics has higher academic expectations and goes beyond just looking at the concepts. It aims at equipping the students to be able to apply the concepts in various contexts.</p><p>Students who are aiming at pursuing higher education in Mathematics and subjects related to mathematics, must opt for HL Mathematics in IBDP.</p><p>Concepts in the IB Mathematics curriculum:</p><ul><li>Algebra</li><li>Functions and Equations</li><li>Circular Functions and Trigonometry</li><li>Vectors</li><li>Statistics and Probability</li><li>Calculus</li></ul><p>To know about all</p><p>For a more detailed IB Mathematics Curriculum Model for HL and SL students <a href='#'>Click here.</a></p>"
        },
        {
            "id": "ib-math2",
            "subject": "Mathematics",
            "heading": "IB Maths SL Coaching",
            "image": "images/ib-math2.jpg",
            "description": "<p>aimIB7 has on board, the best in the Industry teachers who have delivered excellent results in the past years. We provide individual support classes for HL maths in the Core and Options area of the IB curriculum. We have years of experience in guiding student portfolios and Internal Assessments. We have different provisions for IB Math HL coaching. A student can register for a one on one or in groups of not more than 5 students. For more details, <a href='#'>click here</a>.</p><p><strong>IB Mathematics Overview</strong></p><p>The International Baccalaureate Diploma Programme has, in its offering, two options:</p><ul><li>Mathematics at the standard level [SL]</li><li>Mathematics at the higher level [HL]</li></ul><p>The SL offers an academically rich study of core concepts in Mathematics, keeping the rigour of the course and aims at a good conceptual understanding. The SL students study core concepts of Mathematics as do the HL students. The HL course goes deeper into the core concepts and offers more academic challenges. The SL course is aimed at a student who enjoys math upto a certain degree but would not like to pursue in higher studies.</p><p>Higher Level Mathematics has higher academic expectations and goes beyond just looking at the concepts. It aims at equipping the students to be able to apply the concepts in various contexts.</p><p>Students who are aiming at pursuing higher education in Mathematics and subjects related to mathematics, must opt for HL Mathematics in IBDP.</p><p>Concepts in the IB Mathematics curriculum:</p><ul><li>Algebra</li><li>Functions and Equations</li><li>Circular Functions and Trigonometry</li><li>Vectors</li><li>Statistics and Probability</li><li>Calculus</li></ul><p>To know about all</p><p>For a more detailed IB Mathematics Curriculum Model for HL and SL students <a href='#'>Click here.</a></p>"
        },
        {
            "id": "ib-math3",
            "subject": "Mathematics",
            "heading": "Mathematical Studies",
            "image": "images/ib-math3.jpg",
            "description": "<p><strong>Overview: </strong></p><p>In Mathematical studies in SL in IB students are expected to transform common realistic contexts into mathematics; comment on the context; sketch or draw mathematical diagrams, graphs or constructions both on paper and using technology; record methods, solutions and conclusions using standardized notation. Scholars are expected to derive simple deductions and inferences from given statements using logic.</p><p>Skills developed by studying mathematical studies SL can be further used to study other subjects like Economics, statistics and actuarial sciences.</p><p>Course contents</p><ul><li>Number and Algebra</li><li>Descriptive Statistics</li><li>Logic, sets and probability</li><li>Statistical applications</li><li>Geometry and trigonometry</li><li>Mathematical models: 20hrs</li><li>Introduction to differential calculus</li></ul><p>Project</p><p>The project is an individual piece of work involving the collection of information or the generation of measurements, and the analysis and evaluation of the information or measurements: 25hrs</p><p>We at aimIB7 offer customized skill based sessions with organic interaction with a highly-experienced teacher. We guarantee excellent results in this area. For a more detailed IB Mathematics Curriculum Model for HL and SL students. <a href='#'>Click Here</a>.</p>"
        },
        {
            "id": "ib-economics1",
            "subject": "Economics",
            "heading": "Economics Higher Level",
            "image": "images/ib-economics1.jpg",
            "description": "<p>Economics is one of the most dynamic subjects under the umbrella of Group 3, individuals and societies, in IB. Economics studies how individuals allocate with scarce resources for maximising their satisfaction. The challenge students’ face is that Economics as a social science use scientific methods of research by blending quantitative and qualitative techniques.</p><p>The economics syllabus is designed to allow sufficient time within the recommended teaching hours (150 at SL, 240 at HL) for in-depth analysis and evaluation, and consolidation of learning. IB Economics has four functional areas of</p><ul><li>Micro Economics</li><li>Macro Economics</li><li>International Economics and</li><li>Development Economics</li></ul><p>The aims of the economics syllabus at SL and HL are to enable students to:</p><ul><li>develop an understanding of microeconomic and macroeconomic theories and concepts and their real-world application</li><li>develop an appreciation of the impact on individuals and societies of economic interactions between nations</li><li>develop an awareness of development issues facing nations as they undergo the process of change.</li></ul><p>Assessment:</p><p><i><u>I External Assessment (80%)</i></u></p><p>Students in IB HL has to appear for 3 external papers worth 80% of marks:</p><p><strong>Paper 1</strong> (30% weightage) Extended Response Paper)(50 marks, covering Micro and Macro Economics1 hour and 30 minutes)</p><p><strong>Paper 2</strong> (30% weightage) Data Response Paper (40 Marks, covering international and development economics 1 hour and 30 minutes)</p><p><strong>Paper 3</strong> (20% weightage) HL extension paper (50 marks, covering HL Extension material covering micro, macro, international and development Economics 1 hour)</p><p><i><u>II Internal Assessment (20%)</i></u></p><p>This component is internally assessed by the teacher and externally moderated by the IB at the end of the course.</p><p>Students produce three commentaries, based on different sections of the syllabus and on published extracts from the news media having maximum 750 words x 3 (15X3=45 marks)</p><p><strong>HOW ARE WE DIFFERENT</strong></p><p>Our teachers are our assets, we take utter care in collaborating with the best of teachers who are not just subject experts but are skilled in assessment requirement in the IB and teaching pedagogy. We offer content based lessons and skill based lessons which are then followed by mock and practice papers. We provide exclusive support in IAs and give students the edge in creating an overall average that is in tune with his academic requirements. Call our counsellor for an appointment with the subject expert.</p>"
        },
        {
            "id": "ib-economics2",
            "subject": "Economics",
            "heading": "Economics Standard Level",
            "image": "images/ib-economics2.jpg",
            "description": "<p>Economics is one of the most dynamic subjects under the umbrella of Group 3, individuals and societies, in IB. Economics studies how individuals allocate with scarce resources for maximising their satisfaction. The challenge students’ face is that Economics as a social science use scientific methods of research by blending quantitative and qualitative techniques.</p><p>The economics syllabus is designed to allow sufficient time within the recommended teaching hours (150 at SL, 240 at HL) for in-depth analysis and evaluation, and consolidation of learning. IB Economics has four functional areas of</p><ul><li>Micro Economics</li><li>Macro Economics</li><li>International Economics and</li><li>Development Economics</li></ul><p>The aims of the economics syllabus at SL and HL are to enable students to:</p><ul><li>develop an understanding of microeconomic and macroeconomic theories and concepts and their real-world application</li><li>develop an appreciation of the impact on individuals and societies of economic interactions between nations</li><li>develop an awareness of development issues facing nations as they undergo the process of change.</li></ul><p><strong>Economics SL Assessment:</strong></p><p><i><u>I External Assessment (80% weightage)</i></u></p><p>Students in IB HL has to appear for 3 external papers worth 80% of marks:</p><p><strong>Paper 1</strong> (40% weightage): Extended Response Paper, (50 marks, covering Micro and Macro Economics1 hour and 30 minutes)</p><p><strong>Paper 2</strong> (40% weightage): Data Response Paper (40 Marks, covering international and development economics 1 hour and 30 minutes)</p><p><i><u>II Internal Assessment (20% weightage)</i></u></p><p>This component is internally assessed by the teacher and externally moderated by the IB at the end of the course.</p><p>Students produce three commentaries, based on different sections of the syllabus and on published extracts from the news media having maximum 750 words x 3 (15X3=45 marks)</p><p><strong>HOW ARE WE DIFFERENT</strong></p><p>Our teachers are our assets, we take utter care in collaborating with the best of teachers who are not just subject experts but are skilled in assessment requirement in the IB and teaching pedagogy. We offer content based lessons and skill based lessons which are then followed by mock and practice papers. We provide exclusive support in IAs and give students the edge in creating an overall average that is in tune with his academic requirements. Call our counsellor for an appointment with the subject expert.</p>"
        },
        {
            "id": "ib-business-studies1",
            "subject": "Business Studies",
            "heading": "Business Management Higher Level (HL)",
            "image": "images/ib-business-studies1.jpg",
            "description": "<p>Business Management is a challenging, rigorous and dynamic subject under the individuals and societies subject group in IB. Businesses operate by organizing resources, taking risks and bearing uncertainties in a society with the objective of meeting human needs so as to make profit. Therefore the students study all aspects of forming and implementing successful businesses which include business organization and environment, human resources management, Finance and accounts, marketing and operations management. The IB Business Management subject fosters the ability of the students to research which underpins six concepts CUEGIS (Change, Culture, Ethics, Globalization, Innovation and Strategy).</p><p>The business syllabus is designed to allow sufficient time within the recommended teaching hours (150 at SL, 240 at HL). There are four assessment objectives (AO) the students will meet by the end of the course:</p><ol><li>AO1 – Demonstrate Knowledge and understanding</li><li>AO2 - Demonstrate Application and Analysis</li><li>AO3 - Demonstrate Synthesis and evaluation</li><li>AO4 - Demonstrate a variety of appropriate skills</li></ol><p>The IB business management covers broadly four aspects of businesses.</p><ol><li>Unit 1: Business organization and environment</li><li>Unit 2: Human resource management</li><li>Unit 3: Finance and accounts</li><li>Unit 4: Marketing</li><li>Unit 5: Operations Management</li></ol><p><strong>I External Assessment (75% Weightage 4 Hrs. 30 min)</strong></p><p>Students in IB HL has to appear for 3 external papers worth 75% of marks:</p><p>Paper 1 (35% weightage) (2 hour and 15 minutes) 60 Marks</p><p>Assessment: Based on a case study issued in advance, with additional unseen material for section B and C.</p><p><strong>Section A:</strong> (Syllabus content: Units 1-5 including HL Extension topics). Students answer <strong><i><u>two of the three</u></i></strong> structured questions based on a pre-seen case study <strong>(10 marks per question)</strong>.</p><p>Section B: (syllabus content: units 1-5 including HL Extension topics). Students answer one compulsory structured question primarily based on the additional stimulus material. <strong>(20 Marks)</strong></p><p>Section C: (syllabus content: units 1-5 including HL Extension topics). Students answer one compulsory extended response question primarily based on additional stimulus material. <strong>(20 Marks)</strong></p><p><strong>Paper 2 (40% weightage) (2 hour and 15 minutes) 70 Marks</strong></p><p><strong>Section A:</strong> (Syllabus content: Units 1-5 including HL Extension topics). Students answer <strong><i><u>one of the two</u></i></strong> structured questions based on a stimulus material with a quantitative focus <strong>(10 marks)</strong>.</p><p><strong>Section B:</strong> (syllabus content: units 1-5 including HL Extension topics). Students answer <strong><i><u>two of the three</u></i></strong> structured question based on a stimulus material. 20 marks per question <strong>(40 Marks )</strong>.</p><p><strong>Section C:</strong> (syllabus content: units 1-5 including HL Extension topics). Students answer <strong><i><u>one of the three</u></i></strong> extended response question primarily based on two concepts that underpin the course. <strong>(20 Marks)</strong>.</p><p><strong>II Internal Assessment (25% Weightage, 30 teaching Hrs.)</strong></p><p>This component is internally assessed by the teacher and externally moderated by the IB at the end of the course. Teachers spend 30 teaching hours to guide the HL Internal Assessment.</p><p><u>Research project:</u></p><p>Students research and report on an issue facing an organization or a decision to be made by an organization (or several organizations). Maximum 2000 words. (25 marks)</p><p><strong>HOW DO WE CONTRIBUTE?</strong></p><p>Our teachers are our assets, we take utter care in collaborating with the best of teachers who are not just subject experts but are skilled in assessment requirement in the IB and teaching pedagogy. We offer content based lessons and skill based lessons which are then followed by mock and practice papers. We provide exclusive support in IAs and give students the edge in creating an overall average that is in tune with his academic requirements. Call our counsellor for an appointment with the subject expert.</p>"
        },
        {
            "id": "ib-business-studies2",
            "subject": "Business Studies",
            "heading": "Business Management Standard Level (SL)",
            "image": "images/ib-business-studies2.jpg",
            "description": "<p>Business Management is a challenging, rigorous and dynamic subject under the individuals and societies subject group in IB. Businesses operate by organizing resources, taking risks and bearing uncertainties in a society with the objective of meeting human needs so as to make profit. Therefore the students study all aspects of forming and implementing successful businesses which include business organization and environment, human resources management, Finance and accounts, marketing and operations management. The IB Business Management subject fosters the ability of the students to research which underpins six concepts CUEGIS (Change, Culture, Ethics, Globalization, Innovation and Strategy).</p><p>The business syllabus is designed to allow sufficient time within the recommended teaching hours (150 at SL, 240 at HL). There are four assessment objectives (AO) the students will meet by the end of the course:</p><ol><li>AO1 – Demonstrate Knowledge and understanding</li><li>AO2 - Demonstrate Application and Analysis</li><li>AO3 - Demonstrate Synthesis and evaluation</li><li>AO4 - Demonstrate a variety of appropriate skills</li></ol><p>The IB business management covers broadly four aspects of businesses.</p><ol><li>Unit 1: Business organization and environment</li><li>Unit 2: Human resource management</li><li>Unit 3: Finance and accounts</li><li>Unit 4: Marketing</li><li>Unit 5: Operations Management</li></ol><p><strong>I External Assessment (75% Weightage, 3 Hrs) </strong></p><p>Students in IB HL has to appear for 3 external papers worth 75% of marks:</p><p>Paper 1 (30% weightage) (1 hour and 15 minutes) 40 Marks</p><p>Assessment: Based on a case study issued in advance, with additional unseen material for section B and C.</p><p><strong>Section A:</strong> (Syllabus content: Units 1-5). Students answer <strong><i><u>two of the three</u></i></strong> structured questions based on a pre-seen case study <strong>(10 marks per question)</strong>.</p><p><strong>Section B:</strong> (syllabus content: units 1-5). Students answer one compulsory structured question primarily based on the additional stimulus material. <strong>(20 Marks)</strong></p><p><strong>Paper 2 (45% weightage) (1 hour and 45 minutes) 50 Marks</strong></p><p><strong>Section A:</strong> (Syllabus content: Units 1-5). Students answer <strong><i><u>one of the two</u></li></strong> structured questions based on a stimulus material with a quantitative focus <strong>(10 marks)</strong>.</p><p><strong>Section B:</strong> (syllabus content: units 1-5). Students answer <strong><i><u>one of the three</u></li></strong> structured question based on a stimulus material. <strong>(20 Marks )</strong>.</p><p><strong>Section C:</strong> (syllabus content: units 1-5). Students answer <strong><i><u>one of three</u></li></strong> extended response questions primarily based on two concepts that underpin the course. <strong>(20 Marks)</strong>.</p><p><strong>II Internal Assessment (25% Weightage, 15 teaching hrs)</strong></p><p>This component is internally assessed by the teacher and externally moderated by the IB at the end of the course. Teachers spend 15 teaching hours to guide the HL Internal Assessment.</p><p><u>Written Commentary:</u></p><p>Students research and create a written commentary based on three to five supporting documents about a real issue or problem facing a particular company. Maximum 1500 words. (25 marks)</p><p><strong>HOW DO WE CONTRIBUTE?</strong></p><p>Our teachers are our assets, we take utter care in collaborating with the best of teachers who are not just subject experts but are skilled in assessment requirement in the IB and teaching pedagogy. We offer content based lessons and skill based lessons which are then followed by mock and practice papers. We provide exclusive support in IAs and give students the edge in creating an overall average that is in tune with his academic requirements. Call our counsellor for an appointment with the subject expert.</p>"
        },
        {
            "id": "ib-essay-writing1",
            "subject": "Eassy Writing",
            "heading": "High Quality Essay Writing Support at aimIB7",
            "image": "images/ib-eassy-writing1.jpg",
            "description": "<p><strong>You find essay writing difficult? We understand your struggles!</strong></p><p><strong>Do you feel Essay Writing is difficult? At aimIB7 we understand students’ concerns.</strong></p><p>Schools and boards require essays in different areas of the course. IB has Internal Assessments, <span class='highlight'>Extended Essay, Theory of Knowledge Essay, Written Assignments, Written Tasks and College Essays</span> for a student to write. Students find it difficult to handle along with other subjects’ pressures and there is limited time. We provide the necessary time and support to the student along-with help in conducting their research. Periodic guidance and criteria based timely feedback ensures sound development of an essay or IA that scores high and pushes the student average upwards.</p><p>Sometimes the gaps between teachers’ instructions and students’ expectations are so high that they hinder the production of a good IA. It’s perfectly alright to find a teacher who helps you in completion of your essays and also maintains academic honesty.</p><p><span class='highlight'>What should you do when you feel stressed with IAs and essays?</span></p><p>Evaluate the situation thoroughly and identify your strengths and weaknesses. Work on you timelines and discuss them with one of our counsellors. We will tailor a customized schedule and support just for you!</p><ul><li>You can hire a 'writing companion' – a tutor dedicated completely to help you complete your IAs from <a href='http://www.aimib7.com' target='_blank'>www.aimIB7.com</a></li><li>The writing companion helps you identify strengths and weaknesses. Works with you on the guidelines given by your teacher and helps you produce a work that is a true reflection of your potential anyway.</li></ul><p><span class='highlight'>What makes aimIB7 better than essay writing services that kill your creativity?</span></p><p>Students seeking essay writing support must get in conversation with our counsellor who will arrange a tutor interaction and will take you through the whole support process.</p><ul><li>The team of writers we have on board have the capacity to tailor support on short deadlines and complex requirements.</li><li>We provide tutor details and interactions that make you feel confident in the whole process. We are based in India and offer personalized support to students in MUMBAI, PUNE and AHMEDABAD.</li><li>The teachers help you create an Essay or IA that is a true reflection of you and your writing style.</li></ul>"
        }
    ]

}
